app/controllers/tickets_controller.rb

  def index
    if current_user.requiring_user? || current_user.executive?
      @user = current_user
      if @user.requiring_user?
        @tickets = @user.requiring_user_tickets
      end
      if @user.executive?
        @tickets = @user.executive_tickets
        @other_tickets = Ticket.all - @tickets
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."executive_id" = $1  [["executive_id", 8]]

  def index_others
    @tickets = Ticket.where.not(executive_id: current_user.id)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."executive_id" != $1  [["executive_id", 4]]

  def search
    query = params[:query]

    @tickets = []

    if current_user.executive? || current_user.supervisor? || current_user.administrator?
      @tickets += Ticket.where("title LIKE ?", "%#{query}%")
      @tickets += Ticket.where("description LIKE ?","%#{query}%")
      @tickets += Ticket.joins(:requiring_user).where("email LIKE ?","%#{query}%")
---
SELECT "tickets".* FROM "tickets" WHERE (title LIKE '%correctamente%')
SELECT "tickets".* FROM "tickets" WHERE (description LIKE '%correctamente%')
SELECT "tickets".* FROM "tickets" INNER JOIN "users" ON "users"."id" = "tickets"."requiring_user_id" WHERE (requiring_users.email LIKE '%EO%')

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

          content_type: attachment.content_type
        )

        @ticket.attachments.attach(blob)
---
INSERT INTO "tags_tickets" ("tag_id", "ticket_id") VALUES ($1, $2)  [["tag_id", 1], ["ticket_id", 14]]
INSERT INTO "tickets" ("creation_date", "resolution_date", "deadline_date", "title", "description", "priority", "state", "created_at", "updated_at", "executive_id", "requiring_user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    end

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tags_tickets" ("tag_id", "ticket_id") VALUES ($1, $2)  [["tag_id", 1], ["ticket_id", 14]]
INSERT INTO "tickets" ("creation_date", "resolution_date", "deadline_date", "title", "description", "priority", "state", "created_at", "updated_at", "executive_id", "requiring_user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    if params[:ticket][:commit] == "newInCharge"
      executive_new = User.find(params[:ticket][:new_in_charge])
      puts executive_new
      @ticket.executive_id = executive_new.id
      respond_to do |format|
        if @ticket.save
          format.html { redirect_to ticket_url(@ticket), notice: "Ticket was successfully updated." }
          format.json { render :show, status: :ok, location: @ticket }
        else
          format.html { render :edit, status: :unprocessable_entity }
          format.json { render json: @ticket.errors, status: :unprocessable_entity }
        end
      end

    else
      @ticket.tags.clear
      selected_tag_ids = params[:ticket][:tag_ids].reject(&:empty?).map(&:to_i)

      if selected_tag_ids.present?
        selected_tag_ids.each do |tag_id|
          TagsTicket.create(ticket_id: @ticket.id, tag_id: tag_id)
        end
      end

      respond_to do |format|
        if @ticket.update(ticket_params)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tickets" SET "updated_at" = $1, "executive_id" = $2 WHERE "tickets"."id" = $3  [["updated_at", "2023-06-21 23:18:24.989667"], ["executive_id", 8], ["id", 15]]
DELETE FROM "tags_tickets" WHERE "tags_tickets"."ticket_id" = $1 AND "tags_tickets"."tag_id" IN ($2, $3)  [["ticket_id", 5], ["tag_id", 1], ["tag_id", 6]]
UPDATE "tickets" SET "state" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["state", "reopened"], ["updated_at", "2023-06-22 04:19:07.339765"], ["id", 11]]

  def reopen
    @ticket.state = "reopened"
    respond_to do |format|
      if @ticket.save
---
UPDATE "tickets" SET "state" = $1, "updated_at" = $2 WHERE "tickets"."id" = $3  [["state", "reopened"], ["updated_at", "2023-06-22 04:45:37.199650"], ["id", 18]]